daisy212/dbu5g9/FS/Setup/STM32U5G9_ST_STM32U5G9J_DK2/WA_u5_FS_NOR_MT25QL128_SPIFI.c
/*********************************************************************
*                     SEGGER Microcontroller GmbH                    *
*                        The Embedded Experts                        *
**********************************************************************
*                                                                    *
*       (c) 2003 - 2023  SEGGER Microcontroller GmbH                 *
*                                                                    *
*       www.segger.com     Support: support@segger.com               *
*                                                                    *
**********************************************************************
-------------------------- END-OF-HEADER -----------------------------

File    : FS_NOR_HW_SPIFI_STM32U585_ST_B_U585I_IOT02A_Discovery.c
Purpose : Low-level flash driver for STM32U5 OCTO SPI interface.
Literature:
  [1] RM0456 Reference manual STM32U575/585 Arm-based 32-bit MCUs
    (\\fileserver\Techinfo\Company\ST\MCU\STM32\STM32U5\RM0456-STM32U575585.pdf)
  [2] Datasheet STM32U585xx
    (\\fileserver\Techinfo\Company\ST\MCU\STM32\STM32U5\DS13086_STM32U585AI_Rev4.pdf)
  [3] Errata sheet STM32U575xx STM32U585xx
    (\\fileserver\Techinfo_rw\Company\ST\MCU\STM32\STM32U5\ES0499_Rev_0.3_Pub.pdf)
  [4] UM2839 User manual Discovery kit for IoT node with STM32U5 Series
    (\\fileserver\Techinfo\Company\ST\MCU\STM32\STM32U5\EvalBoard\B-U585I-IOT02A Discovery kit\UM2839_B-U585i-iot02a_discovery-kit-(stm32u5-series)_rev3.pdf)
  [5] Datasheet MX25LM51245G
    ("\\FILESERVER\Techinfo\Company\Macronix\SPI_NOR_Flash\MX25LM51245G, 3V, 512Mb, v1.1.pdf")
*/

/*********************************************************************
*
*       #include section
*
**********************************************************************
*/
#include "FS.h"
#include <stdint.h>

#include "stm32u5xx.h"


/*********************************************************************
*
*      Defines, configurable
*
**********************************************************************
*/
#ifndef   FS_NOR_HW_OCTOSPI_CLK_HZ
  #define FS_NOR_HW_OCTOSPI_CLK_HZ      160000000uL     // Frequency of the clock supplied to OCTOSPI peripheral
#endif

#ifndef   FS_NOR_HW_NOR_CLK_HZ
  #define FS_NOR_HW_NOR_CLK_HZ          15000000uL      // Frequency of the clock supplied to NOR flash device
#endif

#ifndef   FS_NOR_HW_USE_OS
  #define FS_NOR_HW_USE_OS              0               // Enables/disables the interrupt-driven operation.
#endif

#ifndef   FS_NOR_HW_USE_MEM_MODE
  #define FS_NOR_HW_USE_MEM_MODE        0               // Enables or disables the reading of NOR flash data via system memory.
                                                        // Has to be set to 0 if the file system is configured with FS_NOR_LINE_SIZE
                                                        // smaller than or equal to 2 because of the errata 2.6.7 in ES0499 Rev. 3.
#endif

/*********************************************************************
*
*       #include section, conditional
*
**********************************************************************
*/
#if FS_NOR_HW_USE_OS
  #include "RTOS.h"
  #include "stm32u5xx.h"
  #include "FS_OS.h"
#endif

/*********************************************************************
*
*       Defines, non-configurable
*
**********************************************************************
essai with octospi1 
pa3 clk, pa6 io3, pa7 io2, pb0 io2, pb1 io0, pe11 ncs

*/

/*********************************************************************
*
*       Octo-SPI registers
#define OCTOSPI_BASE_ADDR       0x420D2400uL    // octospi2
*/
#define OCTOSPI_BASE_ADDR       0x420D1400uL    // octospi1
#define OCTOSPI_CR              (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x000))
#define OCTOSPI_DCR1            (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x008))
#define OCTOSPI_DCR2            (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x00C))
#define OCTOSPI_DCR3            (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x010))
#define OCTOSPI_SR              (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x020))
#define OCTOSPI_FCR             (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x024))
#define OCTOSPI_DLR             (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x040))
#define OCTOSPI_AR              (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x048))
#define OCTOSPI_DR              (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x050))
#define OCTOSPI_DR_BYTE         (*(volatile U8* )(OCTOSPI_BASE_ADDR + 0x050))
#define OCTOSPI_DR_HWORD        (*(volatile U16*)(OCTOSPI_BASE_ADDR + 0x050))
#define OCTOSPI_PSMKR           (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x080))
#define OCTOSPI_PSMAR           (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x088))
#define OCTOSPI_PIR             (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x090))
#define OCTOSPI_CCR             (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x100))
#define OCTOSPI_TCR             (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x108))
#define OCTOSPI_IR              (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x110))
#define OCTOSPI_ABR             (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x120))
#define OCTOSPI_LPTR            (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x130))
#define OCTOSPI_WCCR            (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x180))
#define OCTOSPI_WTCR            (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x188))
#define OCTOSPI_WIR             (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x190))
#define OCTOSPI_WABR            (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x1A0))
#define OCTOSPI_HLCR            (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x200))

/*********************************************************************
*
*       Port A registers
*/
#define GPIOA_BASE_ADDR         0x42020000uL
#define GPIOA_MODER             (*(volatile U32*)(GPIOA_BASE_ADDR + 0x00))
#define GPIOA_OSPEEDR           (*(volatile U32*)(GPIOA_BASE_ADDR + 0x08))
#define GPIOA_PUPDR             (*(volatile U32*)(GPIOA_BASE_ADDR + 0x0C))
#define GPIOA_ODR               (*(volatile U32*)(GPIOA_BASE_ADDR + 0x14))
#define GPIOA_AFRH              (*(volatile U32*)(GPIOA_BASE_ADDR + 0x24))
#define GPIOA_AFRL              (*(volatile U32*)(GPIOA_BASE_ADDR + 0x20))

/*********************************************************************
*
*       Port B registers
*/
#define GPIOB_BASE_ADDR         0x42020400uL
#define GPIOB_MODER             (*(volatile U32*)(GPIOB_BASE_ADDR + 0x00))
#define GPIOB_OSPEEDR           (*(volatile U32*)(GPIOB_BASE_ADDR + 0x08))
#define GPIOB_PUPDR             (*(volatile U32*)(GPIOB_BASE_ADDR + 0x0C))
#define GPIOB_ODR               (*(volatile U32*)(GPIOB_BASE_ADDR + 0x14))
#define GPIOB_AFRH              (*(volatile U32*)(GPIOB_BASE_ADDR + 0x24))
#define GPIOB_AFRL              (*(volatile U32*)(GPIOB_BASE_ADDR + 0x20))

/*********************************************************************
*
*       Port C registers
*/
#define GPIOC_BASE_ADDR         0x42020800uL
#define GPIOC_MODER             (*(volatile U32*)(GPIOC_BASE_ADDR + 0x00))
#define GPIOC_OSPEEDR           (*(volatile U32*)(GPIOC_BASE_ADDR + 0x08))
#define GPIOC_PUPDR             (*(volatile U32*)(GPIOC_BASE_ADDR + 0x0C))
#define GPIOC_ODR               (*(volatile U32*)(GPIOC_BASE_ADDR + 0x14))
#define GPIOC_AFRH              (*(volatile U32*)(GPIOC_BASE_ADDR + 0x24))
#define GPIOC_AFRL              (*(volatile U32*)(GPIOC_BASE_ADDR + 0x20))

/*********************************************************************
*
*       Port D registers
*/
#define GPIOD_BASE_ADDR         0x42020c00uL
#define GPIOD_MODER             (*(volatile U32*)(GPIOD_BASE_ADDR + 0x00))
#define GPIOD_OSPEEDR           (*(volatile U32*)(GPIOD_BASE_ADDR + 0x08))
#define GPIOD_PUPDR             (*(volatile U32*)(GPIOD_BASE_ADDR + 0x0C))
#define GPIOD_ODR               (*(volatile U32*)(GPIOD_BASE_ADDR + 0x14))
#define GPIOD_AFRH              (*(volatile U32*)(GPIOD_BASE_ADDR + 0x24))
#define GPIOD_AFRL              (*(volatile U32*)(GPIOD_BASE_ADDR + 0x20))

/*********************************************************************
*
*       Port E registers
*/
#define GPIOE_BASE_ADDR         0x42021000uL
#define GPIOE_MODER             (*(volatile U32*)(GPIOE_BASE_ADDR + 0x00))
#define GPIOE_OSPEEDR           (*(volatile U32*)(GPIOE_BASE_ADDR + 0x08))
#define GPIOE_PUPDR             (*(volatile U32*)(GPIOE_BASE_ADDR + 0x0C))
#define GPIOE_ODR               (*(volatile U32*)(GPIOE_BASE_ADDR + 0x14))
#define GPIOE_AFRH              (*(volatile U32*)(GPIOE_BASE_ADDR + 0x24))
#define GPIOE_AFRL              (*(volatile U32*)(GPIOE_BASE_ADDR + 0x20))

/*********************************************************************
*
*       Port F registers
*/
#define GPIOF_BASE_ADDR         0x42021400uL
#define GPIOF_MODER             (*(volatile U32*)(GPIOF_BASE_ADDR + 0x00))
#define GPIOF_OSPEEDR           (*(volatile U32*)(GPIOF_BASE_ADDR + 0x08))
#define GPIOF_PUPDR             (*(volatile U32*)(GPIOF_BASE_ADDR + 0x0C))
#define GPIOF_ODR               (*(volatile U32*)(GPIOF_BASE_ADDR + 0x14))
#define GPIOF_AFRH              (*(volatile U32*)(GPIOF_BASE_ADDR + 0x24))
#define GPIOF_AFRL              (*(volatile U32*)(GPIOF_BASE_ADDR + 0x20))

/*********************************************************************
*
*       Port H registers
*/
#define GPIOH_BASE_ADDR         0x42021C00uL
#define GPIOH_MODER             (*(volatile U32*)(GPIOH_BASE_ADDR + 0x00))
#define GPIOH_OSPEEDR           (*(volatile U32*)(GPIOH_BASE_ADDR + 0x08))
#define GPIOH_PUPDR             (*(volatile U32*)(GPIOH_BASE_ADDR + 0x0C))
#define GPIOH_ODR               (*(volatile U32*)(GPIOH_BASE_ADDR + 0x14))
#define GPIOH_AFRL              (*(volatile U32*)(GPIOH_BASE_ADDR + 0x20))
#define GPIOH_AFRH              (*(volatile U32*)(GPIOH_BASE_ADDR + 0x24))

/*********************************************************************
*
*       Port I registers
*/
#define GPIOI_BASE_ADDR         0x42022000uL
#define GPIOI_MODER             (*(volatile U32*)(GPIOI_BASE_ADDR + 0x00))
#define GPIOI_OSPEEDR           (*(volatile U32*)(GPIOI_BASE_ADDR + 0x08))
#define GPIOI_PUPDR             (*(volatile U32*)(GPIOI_BASE_ADDR + 0x0C))
#define GPIOI_ODR               (*(volatile U32*)(GPIOI_BASE_ADDR + 0x14))
#define GPIOI_AFRL              (*(volatile U32*)(GPIOI_BASE_ADDR + 0x20))
#define GPIOI_AFRH              (*(volatile U32*)(GPIOI_BASE_ADDR + 0x24))

/*********************************************************************
*
*       Reset and clock control
*/
#define RCC_BASE_ADDR           0x46020C00uL
#define RCC_AHB2RSTR2           (*(volatile U32*)(RCC_BASE_ADDR + 0x68))
#define RCC_AHB1ENR             (*(volatile U32*)(RCC_BASE_ADDR + 0x88))
#define RCC_AHB2ENR1            (*(volatile U32*)(RCC_BASE_ADDR + 0x8C))
#define RCC_AHB2ENR2            (*(volatile U32*)(RCC_BASE_ADDR + 0x90))
#define RCC_CCIPR2              (*(volatile U32*)(RCC_BASE_ADDR + 0xE4))

/*********************************************************************
*
*       Masks for the peripheral enable bits
*/
#define AHB1ENR_DCACHE1EN       30
#define AHB2ENR1_GPIOAEN        0
#define AHB2ENR1_GPIOBEN        1
#define AHB2ENR1_GPIOCEN        2
#define AHB2ENR1_GPIODEN        3
#define AHB2ENR1_GPIOEEN        4
#define AHB2ENR1_GPIOFEN        5
#define AHB2ENR1_GPIOGEN        6
#define AHB2ENR1_GPIOHEN        7
#define AHB2ENR1_GPIOIEN        8

//#define AHB2ENR1_OCTOSPIMEN     21     // octospi2
#define AHB2ENR1_OCTOSPIMEN     20     // octospi1

//#define AHB2ENR2_OCTOSPI2EN     8      // octospi2
#define AHB2ENR2_OCTOSPI1EN     4      // octospi1

#define CCIPR2_OCTOSPISEL_BIT   20     // common o1 et o2

