daisy212/dbu5g9/FS/Setup/STM32U5G9_ST_STM32U5G9J_DK2/WA_u5_FS_NOR_MT25QL128_SPIFI.c
#define CCIPR2_OCTOSPISEL_MASK  0x3uL

/*********************************************************************
*
*       GPIO bit positions of SPI signals
#define NOR_CS_BIT              5     // Port I
#define NOR_DQS_BIT             12    // Port F
#define NOR_CLK_BIT             4     // Port F
#define NOR_D0_BIT              0     // Port F
#define NOR_D1_BIT              1     // Port F
#define NOR_D2_BIT              2     // Port F
#define NOR_D3_BIT              3     // Port F
#define NOR_D4_BIT              9     // Port H
#define NOR_D5_BIT              10    // Port H
#define NOR_D6_BIT              11    // Port H
#define NOR_D7_BIT              12    // Port H


// pa3 clk, pa6 io3, pa7 io2, pb0 io2, pb1 io0, pe11 ncs
#define NOR_CLK_BIT             4     // Port F
#define NOR_D3_BIT              6     // Port A
#define NOR_D2_BIT              7     // Port A
#define NOR_D1_BIT              0     // Port B
#define NOR_D0_BIT              1     // Port B
#define NOR_CS_BIT              11     // Port E
*/

// pa3 clk, pa6 io3, pa7 io2, pb0 io2, pb1 io0, pe11 ncs
#define NOR_CLK_BIT             3     // Port A
#define NOR_D3_BIT              0     // Port C
#define NOR_D2_BIT              3     // Port C
#define NOR_D1_BIT              2     // Port C
#define NOR_D0_BIT              1     // Port C
#define NOR_CS_BIT              2     // Port A




/*********************************************************************
*
*       GPIO bits and masks
*/
#define OSPEEDR_HIGH            0x2uL
#define OSPEEDR_MASK            0x3uL
#define MODER_ALT               0x2uL
#define MODER_MASK              0x3uL
#define AFR_MASK                0xFuL

/*********************************************************************
*
*       Octo-SPI control register
*/
#define CR_EN_BIT               0
#define CR_ABORT_BIT            1
#define CR_DMAEN_BIT            2
#define CR_TCEN_BIT             3
#define CR_FTHRES_BIT           8
#define CR_FTHRES_MASK          0x2Fu
#define CR_TRIE_BIT             16
#define CR_TCIE_BIT             17
#define CR_FTIE_BIT             18
#define CR_SMIE_BIT             19
#define CR_TOIE_BIT             20
#define CR_APMS_BIT             22
#define CR_FMODE_BIT            28
#define CR_FMODE_WRITE          0x00uL
#define CR_FMODE_READ           0x01uL
#define CR_FMODE_POLL           0x02uL
#define CR_FMODE_MMAP           0x03uL
#define CR_FMODE_MASK           0x03uL

/*********************************************************************
*
*       Octo-SPI device configuration register 1
*/
#define DCR1_CKMODE_BIT         0
#define DCR1_CSHT_DLYBYP           3
#define DCR1_CSHT_BIT           8
#define DCR1_DEVSIZE_BIT        16
#define DCR1_DEVSIZE_MAX        0x16u
#define DCR1_MTYP_BIT           24
#define DCR1_MTYP_MICRON        0uL
#define DCR1_MTYP_MACRONIX      1uL
#define DCR1_MTYP_STANDARD      2uL
#define DCR1_MTYP_MASK          0x7uL

/*********************************************************************
*
*       Octo-SPI device configuration register 2
*/
#define DCR2_PRESCALER_BIT      0
#define DCR2_PRESCALER_MAX      0xFFu

/*********************************************************************
*
*       Octo-SPI status register
*/
#define SR_TEF_BIT              0
#define SR_TCF_BIT              1
#define SR_FTF_BIT              2
#define SR_SMF_BIT              3
#define SR_TOF_BIT              4
#define SR_BUSY_BIT             5
#define SR_FLEVEL_BIT           8
#define SR_FLEVEL_MASK          0x3Fu

/*********************************************************************
*
*       Octo-SPI communication configuration register
*/
#define CCR_IMODE_BIT           0
#define CCR_IDTR_BIT            3
#define CCR_ISIZE_BIT           4
#define CCR_ISIZE_MASK          0x03uL
#define CCR_ADMODE_BIT          8
#define CCR_ADDTR_BIT           11
#define CCR_ADSIZE_BIT          12
#define CCR_ADSIZE_MASK         0x03uL
#define CCR_ABMODE_BIT          16
#define CCR_ABDTR_BIT           19
#define CCR_ABSIZE_BIT          20
#define CCR_ABSIZE_MASK         0x03uL
#define CCR_DMODE_BIT           24
#define CCR_DMODE_NONE          0x00uL
#define CCR_DMODE_SINGLE        0x01uL
#define CCR_DMODE_DUAL          0x02uL
#define CCR_DMODE_QUAD          0x03uL
#define CCR_DMODE_OCTO          0x04uL
#define CCR_DDTR_BIT            27
#define CCR_DQSE_BIT            29

/*********************************************************************
*
*       Octo-SPI timing configuration register
*/
#define TCR_DCYC_BIT            0
#define TCR_DCYC_MASK           0x1FuL
#define TCR_DHQC_BIT            28
#define TCR_SSHIFT            30


/*********************************************************************
*
*       Misc. defines
*/
#define NUM_BYTES_FIFO          16
#define OCTOSPI_PRIO            15
#define WAIT_TIMEOUT_MS         1000
#define CYCLES_PER_MS           150           // Blocks the execution for about 1ms on a CPU running at 78 Mhz.
#define WAIT_TIMEOUT_CYCLES     (WAIT_TIMEOUT_MS * CYCLES_PER_MS)
#define CR2_IOSV_BIT            9
#define LOW_POWER_TIMEOUT       32

/*********************************************************************
*
*      Static data
*
**********************************************************************
*/
static            U32 _ClkDiv;
#if FS_NOR_HW_USE_OS
  static volatile U32 _StatusOSPI;
#endif

/*********************************************************************
*
*      Static code
*
**********************************************************************
*/

/*********************************************************************
*
*       _CalcClockDivider
*
*  Function description
*    Calculates the clock divider of Octio-SPI controller.
*
*  Parameters
*    pFreq_Hz     [OUT] Clock frequency.
*
*  Return value
*    Value of clock divisor.
*/
static U32 _CalcClockDivider(U32 * pFreq_Hz) {
  U32 Div;
  U32 Freq_Hz;
  U32 MaxFreq_Hz;

  //
  // Calculate the divider for the specified QSPI frequency.
  //
  Div        = 0;
  MaxFreq_Hz = *pFreq_Hz;
  for (;;) {
    Freq_Hz = FS_NOR_HW_OCTOSPI_CLK_HZ / (Div + 1u);
    if (Freq_Hz <= MaxFreq_Hz) {
      break;
    }
    ++Div;
    if (Div == DCR2_PRESCALER_MAX) {
      break;
    }
  }
  *pFreq_Hz = Freq_Hz;
  return Div;
}

/*********************************************************************
*
*       _CalcTransferMode
*
*  Function description
*    Calculates the transfer mode of Octo-SPI controller.
*
*  Parameters
*    BusWidth       Number of data lines to be used for the data transfer.
*    NumBytes       Number of bytes to be transferred. Can be 0.
*
*  Return value
*    Value of transfer mode.
*/
static U32 _CalcTransferMode(unsigned BusWidth, U32 NumBytes) {
  U32 Mode;

  Mode = CCR_DMODE_NONE;
  if (NumBytes != 0) {
    switch (BusWidth) {
    case 1:
      Mode = CCR_DMODE_SINGLE;
      break;
    case 2:
      Mode = CCR_DMODE_DUAL;
      break;
    case 4:
      Mode = CCR_DMODE_QUAD;
      break;
    case 8:
      Mode = CCR_DMODE_OCTO;
      break;
    default:
      break;
    }
  }
  return Mode;
}

/*********************************************************************
*
*       _CalcNumCycles
*
*  Function description
*    Calculates the number of clock cycles required
*    to transfer a specified number of bytes.
*
*  Parameters
*    BusWidth       Number of data lines to be used for the data transfer.
*    NumBytes       Number of bytes to be transferred. Can be 0.
*    IsDTRMode      Indicates if the data is transferred on both clock cycles.
*
*  Return value
*    Number of clock cycles.
*/
static U32 _CalcNumCycles(unsigned BusWidth, U32 NumBytes, int IsDTRMode) {
  U32 NumCycles;

