daisy212/dbu5g9/FS/Setup/STM32U5G9_ST_STM32U5G9J_DK2/WA_u5_FS_NOR_MT25QL128_SPIFI.c
OSPI_HandleTypeDef hospi1_;
void    Error_Handler(int err_no);

static int _HW_Init(U8 Unit) {
  U32 Freq_Hz;

  FS_USE_PARA(Unit);
  //
  // Select the clock source for OCTOSPI.
  //
  RCC_CCIPR2 &= ~(CCIPR2_OCTOSPISEL_MASK << CCIPR2_OCTOSPISEL_BIT);
  //
  // Enable the clocks of peripherals and reset them.
  //
  RCC_AHB2ENR1 |= 0
               | (1uL << AHB2ENR1_GPIOAEN)
               | (1uL << AHB2ENR1_GPIOBEN)
               | (1uL << AHB2ENR1_GPIOCEN)
               | (1uL << AHB2ENR1_GPIOEEN)
               | (1uL << AHB2ENR1_GPIOFEN)
               | (1uL << AHB2ENR1_GPIOHEN)
               | (1uL << AHB2ENR1_GPIOIEN)
               | (1uL << AHB2ENR1_OCTOSPIMEN)
               ;
  RCC_AHB1ENR  |= 1uL << AHB1ENR_DCACHE1EN;         // Acc. to [1] it is necessary to enable this clock even when the data cache is not used.
  RCC_AHB2ENR2 |= 1uL << AHB2ENR2_OCTOSPI1EN;


  //
  // Wait for the unit to exit reset.
  //
  for (;;) {
    if ((RCC_AHB2RSTR2 & (1uL << AHB2ENR2_OCTOSPI1EN)) == 0) {
      break;
    }
  }
// Alternate function 0xa  : ospi1, port1, v package

  //
  // CS is an output signal and is controlled by the OCTOSPI unit.
  //
  GPIOA_MODER   &= ~(MODER_MASK   << ( NOR_CS_BIT       << 1));
  GPIOA_MODER   |=  (MODER_ALT    << ( NOR_CS_BIT       << 1));
  // sup à 8 ???
  GPIOA_AFRL    &= ~(AFR_MASK     << ((NOR_CS_BIT - 0)  << 2));
  GPIOA_AFRL    |=  (0xauL        << ((NOR_CS_BIT - 0)  << 2));
  GPIOA_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_CS_BIT       << 1));
  GPIOA_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_CS_BIT       << 1));
  //
  // DQS is an output signal and is controlled by the OCTOSPI unit.
  /*
  GPIOF_MODER   &= ~(MODER_MASK   << ( NOR_DQS_BIT      << 1));
  GPIOF_MODER   |=  (MODER_ALT    << ( NOR_DQS_BIT      << 1));
  GPIOF_AFRH    &= ~(AFR_MASK     << ((NOR_DQS_BIT - 8) << 2));
  GPIOF_AFRH    |=  (0x5uL        << ((NOR_DQS_BIT - 8) << 2));
  GPIOF_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_DQS_BIT      << 1));
  GPIOF_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_DQS_BIT      << 1));
*/
  //
  // CLK is an output signal controlled by the OCTOSPI unit.
  //
  GPIOA_MODER   &= ~(MODER_MASK   << ( NOR_CLK_BIT      << 1));
  GPIOA_MODER   |=  (MODER_ALT    << ( NOR_CLK_BIT      << 1));
  GPIOA_AFRL    &= ~(AFR_MASK     << ((NOR_CLK_BIT - 0) << 2));
  GPIOA_AFRL    |=  (0xauL        << ((NOR_CLK_BIT - 0) << 2));
  GPIOA_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_CLK_BIT      << 1));
  GPIOA_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_CLK_BIT      << 1));
  //
  // D0 is an input/output signal controlled by the OCTOSPI unit.
  //
  GPIOC_MODER   &= ~(MODER_MASK   << ( NOR_D0_BIT      << 1));
  GPIOC_MODER   |=  (MODER_ALT    << ( NOR_D0_BIT      << 1));
  GPIOC_AFRL    &= ~(AFR_MASK     << ((NOR_D0_BIT - 0) << 2));
  GPIOC_AFRL    |=  (0xauL        << ((NOR_D0_BIT - 0) << 2));
  GPIOC_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D0_BIT      << 1));
  GPIOC_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D0_BIT      << 1));
  //
  // D1 is an input/output signal controlled by the OCTOSPI unit.
  //
  GPIOC_MODER   &= ~(MODER_MASK   << ( NOR_D1_BIT      << 1));
  GPIOC_MODER   |=  (MODER_ALT    << ( NOR_D1_BIT      << 1));
  GPIOC_AFRL    &= ~(AFR_MASK     << ((NOR_D1_BIT - 0) << 2));
  GPIOC_AFRL    |=  (0xauL        << ((NOR_D1_BIT - 0) << 2));
  GPIOC_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D1_BIT      << 1));
  GPIOC_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D1_BIT      << 1));
  //
  // D2 is an input/output signal and is controlled by the OCTOSPI unit.
  //
  GPIOC_MODER   &= ~(MODER_MASK   << ( NOR_D2_BIT      << 1));
  GPIOC_MODER   |=  (MODER_ALT    << ( NOR_D2_BIT      << 1));
  GPIOC_AFRL    &= ~(AFR_MASK     << ((NOR_D2_BIT - 0) << 2));
  GPIOC_AFRL    |=  (0xauL        << ((NOR_D2_BIT - 0) << 2));
  GPIOC_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D2_BIT      << 1));
  GPIOC_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D2_BIT      << 1));
  //
  // D3 is an output signal and is controlled by the OCTOSPI unit.
  //
  GPIOC_MODER   &= ~(MODER_MASK   << ( NOR_D3_BIT      << 1));
  GPIOC_MODER   |=  (MODER_ALT    << ( NOR_D3_BIT      << 1));
  GPIOC_AFRL    &= ~(AFR_MASK     << ((NOR_D3_BIT - 0) << 2));
  GPIOC_AFRL    |=  (0x3uL        << ((NOR_D3_BIT - 0) << 2));
  GPIOC_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D3_BIT      << 1));
  GPIOC_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D3_BIT      << 1));
  //
  // D4 is an output signal and is controlled by the OCTOSPI unit.
  /*
  GPIOH_MODER   &= ~(MODER_MASK   << ( NOR_D4_BIT      << 1));
  GPIOH_MODER   |=  (MODER_ALT    << ( NOR_D4_BIT      << 1));
  GPIOH_AFRH    &= ~(AFR_MASK     << ((NOR_D4_BIT - 8) << 2));
  GPIOH_AFRH    |=  (0x5uL        << ((NOR_D4_BIT - 8) << 2));
  GPIOH_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D4_BIT      << 1));
  GPIOH_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D4_BIT      << 1));
  //
  // D5 is an output signal and is controlled by the OCTOSPI unit.
  //
  GPIOH_MODER   &= ~(MODER_MASK   << ( NOR_D5_BIT      << 1));
  GPIOH_MODER   |=  (MODER_ALT    << ( NOR_D5_BIT      << 1));
  GPIOH_AFRH    &= ~(AFR_MASK     << ((NOR_D5_BIT - 8) << 2));
  GPIOH_AFRH    |=  (0x5uL        << ((NOR_D5_BIT - 8) << 2));
  GPIOH_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D5_BIT      << 1));
  GPIOH_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D5_BIT      << 1));
  //
  // D6 is an output signal and is controlled by the OCTOSPI unit.
  //
  GPIOH_MODER   &= ~(MODER_MASK   << ( NOR_D6_BIT      << 1));
  GPIOH_MODER   |=  (MODER_ALT    << ( NOR_D6_BIT      << 1));
  GPIOH_AFRH    &= ~(AFR_MASK     << ((NOR_D6_BIT - 8) << 2));
  GPIOH_AFRH    |=  (0x5uL        << ((NOR_D6_BIT - 8) << 2));
  GPIOH_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D6_BIT      << 1));
  GPIOH_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D6_BIT      << 1));
  //
  // D7 is an output signal and is controlled by the OCTOSPI unit.
  //
  GPIOH_MODER   &= ~(MODER_MASK   << ( NOR_D7_BIT      << 1));
  GPIOH_MODER   |=  (MODER_ALT    << ( NOR_D7_BIT      << 1));
  GPIOH_AFRH    &= ~(AFR_MASK     << ((NOR_D7_BIT - 8) << 2));
  GPIOH_AFRH    |=  (0x5uL        << ((NOR_D7_BIT - 8) << 2));
  GPIOH_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D7_BIT      << 1));
  GPIOH_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D7_BIT      << 1));
*/

